[
  {
    "name": "Full Body Workout",
    "icon": "figure.strengthtraining.traditional",
    "color": "blue",
    "exercises": [
      {
        "section": "Warm-up",
        "move": "Lay-back knee hugs",
        "description": "Laying on your back with your legs extended, pull one knee toward your chest with hands behind the thigh, keep head up to engage core",
        "detailed_description": "This dynamic warm-up exercise targets hip flexor mobility, lower back tension release, and core activation. Begin lying supine with legs fully extended and arms by your sides. Slowly draw one knee toward your chest, grasping behind the thigh (not on the knee joint) with both hands. Keep your head and shoulders slightly lifted off the ground to engage your abdominal muscles. The opposite leg should remain straight and pressed into the floor to maintain pelvic stability. This movement helps prepare your hips for more dynamic activities while gently awakening your core muscles. Focus on controlled breathing throughout the movement - exhale as you pull the knee in, inhale as you extend back out.",
        "json_file": "lay_back_knee_hugs.json",
        "video_file": "lay_back_knee_hugs",
        "beginner": "10 reps each side (1 round)",
        "intermediate": "10 reps each side (2 rounds)",
        "advanced": "12 reps each side (2 rounds)"
      },
  {
    "section": "Warm-up",
    "move": "Straight-leg hugs",
    "description": "Lie on your back, extend one leg straight up, grab behind your thigh just below the knee crease, pull gently",
    "detailed_description": "This exercise primarily targets hamstring flexibility, hip mobility, and posterior chain activation. Begin lying supine with both legs extended flat on the floor. Slowly lift one leg straight up toward the ceiling, keeping the knee locked and foot flexed. Reach both hands behind the thigh just below the knee crease, avoiding pressure directly on the knee joint. Gently pull the leg toward your chest while maintaining the straight-leg position and keeping your opposite leg pressed firmly into the floor. This movement helps improve hamstring flexibility essential for skateboarding stance and reduces lower back tension by lengthening the posterior chain. Focus on breathing deeply and avoid bouncing or forcing the stretch - let gravity and gentle pressure create the lengthening effect.",
    "json_file": "straight_leg_hugs.json",
    "video_file": "straight_leg_hugs",
    "beginner": "10 reps each side (1 round)",
    "intermediate": "10 reps each side (2 rounds)",
    "advanced": "12 reps each side (2 rounds)"
  },
  {
    "section": "Warm-up",
    "move": "Glute bridges",
    "description": "Lie on your back with knees bent, lift hips by squeezing your glutes until your body forms a straight line",
    "detailed_description": "This foundational movement targets the glutes, hamstrings, and core while improving hip extension mobility. Begin lying on your back with knees bent at approximately ninety degrees, feet flat on the floor hip-width apart, and arms relaxed by your sides. Initiate the movement by squeezing your glutes and driving your heels into the floor to lift your hips toward the ceiling. Create a straight line from your knees to your shoulders at the top position, avoiding overarching your lower back. This exercise strengthens the posterior chain muscles crucial for powerful skateboarding movements like ollies and transitions while counteracting the hip flexor tightness common from prolonged sitting. Focus on quality over speed - pause briefly at the top of each repetition and lower with control to maximize glute activation.",
    "json_file": "glute_bridges.json",
    "video_file": "glute_bridges",
    "beginner": "12 reps (1 round)",
    "intermediate": "12 reps (2 rounds)",
    "advanced": "15 reps (2 rounds)"
  },
  {
    "section": "Warm-up",
    "move": "Banded glute-bridge abductors",
    "description": "In bridge position with a band above knees, press your knees outward against the band, then return",
    "detailed_description": "This exercise targets the gluteus medius, gluteus maximus, and hip stabilizers while adding lateral resistance training. Start in a standard glute bridge position with a resistance band placed just above your knees and feet hip-width apart. Maintain the elevated hip position throughout the movement while pressing your knees outward against the band resistance, focusing on the outer glutes and hip abductors. Control the return to neutral position without letting the band snap your knees inward. This movement is essential for skateboarding as it strengthens the muscles responsible for lateral stability and board control during turns and transitions. The combination of bridge and abduction creates functional strength patterns that directly translate to improved balance and power on the skateboard. Keep your core engaged and avoid compensating with your lower back.",
    "json_file": "banded_glute_bridge_abductors.json",
    "video_file": "banded_glute_bridge_abductors",
    "beginner": "15 reps (1 round)",
    "intermediate": "15 reps (2 rounds)",
    "advanced": "20 reps (2 rounds)"
  },
  {
    "section": "Warm-up",
    "move": "Ankle circles",
    "description": "Sit or stand, lift one foot off the ground, rotate the ankle in big circles clockwise then counterclockwise",
    "detailed_description": "This mobility exercise targets ankle joint range of motion and activates the intrinsic foot muscles crucial for skateboard control. Begin in a seated or standing position with good posture, then lift one foot slightly off the ground. Create large, controlled circular motions with your ankle, focusing on moving through the full range of motion in both directions. Start with slow, deliberate circles to warm up the joint capsule and surrounding tissues. This exercise is particularly important for skateboarders as ankle mobility directly impacts board feel, push-off efficiency, and landing mechanics. Restricted ankle mobility can lead to compensatory movements up the kinetic chain, affecting knee and hip function. Take your time with each circle, emphasizing the end ranges of dorsiflexion, plantarflexion, inversion, and eversion to maintain optimal joint health and skateboarding performance.",
    "json_file": "ankle_circles.json",
    "video_file": "ankle_circles",
    "beginner": "10 each direction/foot (1 round)",
    "intermediate": "10 each direction/foot (2 rounds)",
    "advanced": "12 each direction/foot (2 rounds)"
  },
  {
    "section": "Warm-up",
    "move": "Banded ankle flicks",
    "description": "Loop a band around one foot, tap the foot forward/back or in/out against band tension to fire up stabilizers",
    "detailed_description": "This dynamic activation exercise targets the deep ankle stabilizers, peroneals, and tibialis muscles essential for proprioception and injury prevention. Begin with a resistance band looped around the forefoot or mid-foot area, securing the other end to a stable anchor point. From a seated or standing position, perform quick, controlled movements in all four directions - dorsiflexion pulling the toes toward you, plantarflexion pointing away, inversion turning the sole inward, and eversion turning it outward. The resistance challenges the small intrinsic muscles that provide fine motor control and stability during skateboarding. These muscles are critical for making subtle adjustments on the board, absorbing impact during landings, and preventing ankle sprains. Focus on crisp, precise movements rather than large range of motion, as this exercise is about neuromuscular activation and preparing the ankle complex for more demanding activities.",
    "json_file": "banded_ankle_flicks.json",
    "video_file": "banded_ankle_flicks",
    "beginner": "10 each direction/foot (1 round)",
    "intermediate": "10 each direction/foot (2 rounds)",
    "advanced": "12 each direction/foot (2 rounds)"
  },
  {
    "section": "Main",
    "move": "Banded knee drives",
    "description": "Loop the band around the balls of your feet, stand tall, and drive one knee up to hip height against band tension",
    "detailed_description": "This dynamic strength and coordination exercise targets the hip flexors, core stabilizers, and ankle proprioceptors while challenging balance and neuromuscular control. Begin standing with a resistance band looped around the balls of both feet, maintaining good posture with shoulders back and core engaged. Drive one knee up explosively to hip height while resisting the downward pull of the band, then control the descent back to the starting position. The standing leg must work to maintain stability against the band's resistance, while the lifting leg develops powerful hip flexion essential for skateboarding movements like ollies and manual pads. This exercise directly improves the ability to generate quick, controlled leg movements while maintaining balance on the skateboard. Focus on maintaining proper alignment throughout the movement and resist the tendency to lean or compensate with upper body movement.",
    "json_file": "banded_knee_drives.json",
    "video_file": "banded_knee_drives",
    "beginner": "6 reps/side (light band)",
    "intermediate": "8 reps/side (medium band)",
    "advanced": "10 reps/side (heavy band)"
  },
  {
    "section": "Main",
    "move": "Lateral banded walk",
    "description": "Place the band just above your knees, sink into a shallow squat, and shuffle side-to-side keeping tension",
    "detailed_description": "This exercise specifically targets the gluteus medius, gluteus minimus, and hip abductors that are crucial for lateral stability and board control during skateboarding. Begin with a resistance band positioned just above your knees, then sink into a partial squat position with feet hip-width apart and core engaged. Maintain constant tension in the band as you step laterally, leading with the outside leg while keeping both knees tracking over your toes. The trailing leg should resist the inward pull of the band, creating co-contraction of the hip stabilizers. This movement pattern directly translates to improved lateral balance and control when carving, transitioning between rails, or maintaining stability during side-to-side weight shifts on the skateboard. Keep your torso upright and avoid allowing the knees to cave inward, as proper knee tracking is essential for injury prevention and optimal performance.",
    "json_file": "lateral_banded_walk.json",
    "video_file": "lateral_banded_walk",
    "beginner": "12 steps each way (light band)",
    "intermediate": "15 steps each way (medium band)",
    "advanced": "20 steps each way (heavy band)"
  },
  {
    "section": "Main",
    "move": "Balanced RDL pass-through",
    "description": "Hinge on one leg, lower your torso and pass a dumbbell under the lifted leg, then stand back up",
    "detailed_description": "This advanced functional exercise combines single-leg Romanian deadlift mechanics with dynamic coordination challenges that directly improve skateboarding balance and core stability. Begin standing on one leg while holding a dumbbell in the opposite hand, then hinge at the hip to lower your torso while extending the free leg behind you for counterbalance. At the bottom position, pass the dumbbell under the elevated leg to the other hand, then reverse the movement to return to standing. This exercise targets the posterior chain including hamstrings and glutes while challenging proprioception and inter-limb coordination essential for complex skateboarding maneuvers. The movement mimics the dynamic balance adjustments required when navigating obstacles or performing tricks that require shifting weight and maintaining control in unstable positions. Focus on maintaining a straight line from your head to the elevated heel and control the dumbbell throughout the entire range of motion to maximize stability benefits.",
    "json_file": "balanced_rdl_pass_through.json",
    "video_file": "balanced_rdl_pass_through",
    "beginner": "6 reps/side (5 lb dumbbell)",
    "intermediate": "8 reps/side (10 lb dumbbell)",
    "advanced": "10 reps/side (15 lb dumbbell)"
  },
  {
    "section": "Main",
    "move": "Banded side leg raise",
    "description": "With band above ankles, stand tall and lift one leg straight out to the side, keeping hips level",
    "detailed_description": "This targeted hip abduction exercise strengthens the gluteus medius and tensor fasciae latae while improving single-leg stability essential for skateboarding control and injury prevention. Position a resistance band around both ankles and stand tall with feet hip-width apart, engaging your core and maintaining neutral spine alignment. Lift one leg straight out to the side against the band resistance while keeping both hips level and avoiding any tilting or compensatory movements in the torso. The standing leg must work to maintain stability while the lifting leg develops the lateral strength needed for board control during turns, carves, and lateral weight shifts. This exercise directly addresses the hip abductor strength often lacking in skateboarders, which can lead to knee injuries and poor board control. Focus on controlled movement both up and down, resisting the band's pull throughout the entire range of motion to maximize muscle activation and stability benefits.",
    "json_file": "banded_side_leg_raise.json",
    "video_file": "banded_side_leg_raise",
    "beginner": "10 reps/side (light band)",
    "intermediate": "12 reps/side (medium band)",
    "advanced": "15 reps/side (heavy band)"
  },
  {
    "section": "Main",
    "move": "Weighted single-leg balance hold",
    "description": "Stand on one leg holding weights in each hand, keep torso upright and core engaged for the duration",
    "detailed_description": "This static stability exercise develops the deep stabilizer muscles throughout the kinetic chain while improving proprioceptive awareness crucial for skateboard control and landing mechanics. Stand on one leg while holding dumbbells in both hands, maintaining an upright torso position with shoulders square and core fully engaged. The added weight challenges your balance system by raising the center of gravity and requiring greater muscular co-contraction to maintain stability. This exercise directly translates to improved board control during stationary balance challenges, manual pads, and one-footed skating scenarios common in street and transition skateboarding. The sustained muscle activation develops the postural endurance needed for long skating sessions while enhancing the reflexive stabilization responses essential for preventing falls and injuries. Focus on maintaining steady breathing and avoid excessive swaying or compensatory movements - small adjustments are normal and beneficial for training your balance system.",
    "json_file": "weighted_single_leg_balance_hold.json",
    "video_file": "weighted_single_leg_balance_hold",
    "beginner": "20 s/side (2×5 lb)",
    "intermediate": "30 s/side (2×10 lb)",
    "advanced": "45 s/side (2×15 lb)"
  },
  {
    "section": "Cool-down",
    "move": "Straight-leg hamstring hug",
    "description": "Lie on your back, extend one leg straight up, grab behind your thigh just below the knee crease, flex toes, pull",
    "detailed_description": "This static stretching exercise targets hamstring flexibility and posterior chain mobility while promoting relaxation and recovery after intense physical activity. Begin lying supine with both legs extended, then slowly lift one leg straight toward the ceiling, keeping the knee locked and foot actively flexed. Grasp behind the thigh just below the knee crease with both hands, avoiding direct pressure on the knee joint itself. Gently pull the leg toward your chest while maintaining the straight-leg position and keeping the opposite leg pressed firmly into the floor. This stretch directly addresses hamstring tightness common in skateboarders from the crouched skating position and helps restore normal hip and knee range of motion. The active foot flexion also provides a gentle stretch to the calf muscles and plantar fascia, addressing the full posterior chain that works hard during skateboarding sessions.",
    "json_file": "straight_leg_hamstring_hug.json",
    "video_file": "straight_leg_hamstring_hug",
    "beginner": "Hold 15 s/side",
    "intermediate": "Hold 30 s/side",
    "advanced": "Hold 45 s/side"
  },
  {
    "section": "Cool-down",
    "move": "Calf wall stretch",
    "description": "Stand facing a wall, place ball of one foot on it, heel on ground, then lean hips forward to stretch calf",
    "detailed_description": "This effective static stretch targets the gastrocnemius and soleus muscles of the calf complex, which often become tight from the constant push-off demands of skateboarding. Stand facing a wall at arm's length, then place the ball of one foot against the wall with your heel firmly planted on the ground. Keep the stretching leg straight and slowly lean your hips forward toward the wall, maintaining the heel contact with the ground throughout the movement. You should feel a strong stretch through the back of your calf and into your Achilles tendon. This stretch is particularly important for skateboarders as tight calves can limit ankle mobility, affecting stance depth and push-off efficiency. The wall provides stable support and allows for consistent pressure application. Focus on breathing deeply and avoid bouncing, as the tissues respond better to sustained, gentle pressure that allows for gradual lengthening.",
    "json_file": "calf_wall_stretch.json",
    "video_file": "calf_wall_stretch",
    "beginner": "Hold 15 s/side",
    "intermediate": "Hold 30 s/side",
    "advanced": "Hold 45 s/side"
  },
  {
    "section": "Cool-down",
    "move": "Figure-four stretch",
    "description": "Lie on your back, cross one ankle over the opposite thigh, then pull the uncrossed leg toward your chest",
    "detailed_description": "This comprehensive hip stretch targets the piriformis, gluteus medius, and deep hip rotator muscles that can become tight and imbalanced from skateboarding's asymmetrical stance patterns. Begin lying supine with both knees bent and feet flat on the floor. Cross one ankle over the opposite thigh just above the knee, creating a figure-four shape with your legs. Reach through the gap between your legs and grasp behind the thigh of the uncrossed leg, then gently pull both legs toward your chest. This position creates a deep stretch through the outer hip, glutes, and piriformis of the crossed leg while also addressing hip flexor mobility. The stretch is particularly beneficial for skateboarders who develop tightness from consistently riding in the same stance, helping restore balanced hip mobility and reducing the risk of lower back pain and hip dysfunction. Maintain steady breathing and avoid forcing the stretch, allowing gravity and gentle pressure to gradually increase the range of motion.",
    "json_file": "figure_four_stretch.json",
    "video_file": "figure_four_stretch",
    "beginner": "Hold 15 s/side",
    "intermediate": "Hold 30 s/side",
    "advanced": "Hold 45 s/side"
  },
  {
    "section": "Cool-down",
    "move": "Standing crossed-leg hamstring",
    "description": "Cross one foot in front of the other, hinge at the hips and lean forward over the front leg to stretch it",
    "detailed_description": "This functional hamstring stretch combines hip hinge mechanics with targeted posterior chain lengthening, making it particularly relevant for skateboarders who need both flexibility and movement pattern reinforcement. Begin standing with feet hip-width apart, then cross one foot in front of the other, keeping both feet planted firmly on the ground. Initiate the movement by pushing your hips backward and hinging forward from the hips, lowering your torso toward the front leg while keeping your spine neutral and shoulders back. The crossed-leg position isolates the hamstring stretch to the front leg while challenging balance and proprioception. This stretch addresses the hamstring tightness common in skateboarders while reinforcing the hip hinge pattern essential for proper movement mechanics in skateboarding and daily activities. The standing position also incorporates functional balance challenges that translate directly to improved board control and stability. Focus on maintaining proper spinal alignment and avoid rounding your back as you hinge forward.",
    "json_file": "standing_crossed_leg_hamstring.json",
    "video_file": "standing_crossed_leg_hamstring",
    "beginner": "Hold 15 s/side",
    "intermediate": "Hold 30 s/side",
    "advanced": "Hold 45 s/side"
      }
    ]
  },
  {
    "name": "Mobility & Activation",
    "icon": "figure.flexibility",
    "color": "orange",
    "exercises": [
      {
        "section": "Warm-up",
        "move": "Kneeling ins and outs",
        "description": "From a kneeling position, step one leg out to the side and back in to open hips (stretches quads, hamstrings, hips, gluteus medius).",
        "detailed_description": "This dynamic mobility exercise targets hip flexor flexibility, gluteus medius activation, and multi-planar hip movement essential for skateboarding transitions and board control. Begin in a tall kneeling position with both knees on the ground and torso upright, engaging your core for stability. Step one leg out laterally into a side lunge position, allowing the hip to open and stretch while maintaining balance on the opposite knee. Return to the starting kneeling position with control, feeling the activation through your hip abductors and quadriceps. This movement directly improves the hip mobility needed for deep skateboarding stances, carving motions, and the lateral weight shifts required during technical maneuvers. The exercise also enhances proprioceptive awareness and single-leg stability that transfers to improved board control and injury prevention during skating sessions.",
        "json_file": "kneeling_ins_and_outs.json",
        "video_file": "kneeling_ins_and_outs",
        "beginner": "10 reps each side (1 round)",
        "intermediate": "10–12 reps each side (2 rounds)",
        "advanced": "12–15 reps each side (2 rounds)"
      },
      {
        "section": "Warm-up",
        "move": "Knee hug turns",
        "description": "Standing knee hug, rotate through the hip as you step and turn.",
        "detailed_description": "This dynamic warm-up combines hip flexor mobility with rotational movement patterns that directly prepare the body for skateboarding's multi-directional demands. Begin standing tall, then lift one knee toward your chest while grasping behind the thigh with both hands. As you hold the knee hug position, initiate a controlled rotation through your torso and hip, stepping the lifted leg across your body in a turning motion before placing it down. The movement activates hip flexors, improves rotational mobility through the thoracic spine, and challenges balance and coordination systems. This exercise specifically prepares skateboarders for the rotational components found in turns, transition skating, and trick execution where the body must coordinate upper and lower body rotation while maintaining balance. Focus on smooth, controlled movements rather than speed, allowing the hip and spine to gradually warm up and increase range of motion.",
        "json_file": "knee_hug_turns.json",
        "video_file": "knee_hug_turns",
        "beginner": "8–10 reps each side (1 round)",
        "intermediate": "10 reps each side (2 rounds)",
        "advanced": "12 reps each side (2 rounds)"
      },
      {
        "section": "Warm-up",
        "move": "Heel floor bridges",
        "description": "Lie on back, heels on floor, drive hips up by squeezing glutes.",
        "detailed_description": "This variation of the glute bridge emphasizes posterior chain activation while improving ankle dorsiflexion mobility crucial for proper skateboarding stance and push-off mechanics. Begin lying supine with only your heels in contact with the floor, toes pulled up toward your shins to create an active stretch through your calves. Drive your hips up by powerfully contracting your glutes and hamstrings, creating a straight line from knees to shoulders at the top position. The heel-only contact increases the challenge to your posterior chain while simultaneously stretching the plantar fascia and calf muscles that often become tight from skateboarding. This exercise directly improves the hip extension power needed for explosive skateboarding movements like ollies and vert wall rides, while addressing the ankle mobility restrictions that can limit skateboarding stance depth and board control. Focus on maintaining the toe-up position throughout the movement to maximize the mobility benefits.",
        "json_file": "heel_floor_bridges.json",
        "video_file": "heel_floor_bridges",
        "beginner": "12 reps (1 round)",
        "intermediate": "12–15 reps (2 rounds)",
        "advanced": "15–20 reps (2 rounds)"
      },
      {
        "section": "Warm-up",
        "move": "Pigeon bridges",
        "description": "Figure-four/pigeon position through one hip while bridging the hips up.",
        "detailed_description": "This advanced mobility exercise combines hip flexor stretching with glute activation, specifically targeting the deep hip rotators and piriformis muscle that can become tight from skateboarding's asymmetrical stance patterns. Begin lying on your back, then cross one ankle over the opposite knee in a figure-four position, creating external rotation through the hip. From this position, drive your hips up into a bridge while maintaining the crossed-leg position, feeling a deep stretch through the outer hip and glutes of the crossed leg. The bridging motion simultaneously activates the glutes of the supporting leg while stretching the hip rotators of the crossed leg. This movement is particularly beneficial for skateboarders who develop tightness and imbalances from consistently riding in the same stance, as it addresses both mobility restrictions and strength imbalances that can affect board control and increase injury risk. Progress slowly and avoid forcing the range of motion, allowing the tissues to gradually adapt to the combined stretch and strengthening demands.",
        "json_file": "pigeon_bridges.json",
        "video_file": "pigeon_bridges",
        "beginner": "8–10 reps each side (1 round)",
        "intermediate": "10–12 reps each side (2 rounds)",
        "advanced": "12–15 reps each side (2 rounds)"
      },
      {
        "section": "Warm-up",
        "move": "Banded Glute Bridge Abductors",
        "description": "Mini-band above knees; press knees out and return under control.",
        "detailed_description": "This dual-purpose exercise activates both the gluteus maximus through the bridge component and the gluteus medius through the abduction movement, creating comprehensive hip stability essential for skateboard control and injury prevention. Begin in a standard glute bridge position with a resistance band positioned just above your knees, then lift your hips while simultaneously pressing your knees outward against the band resistance. The combination challenges your hip stabilizers to work in multiple planes simultaneously, mimicking the complex demands of skateboarding where hip stability is required in various positions and orientations. This exercise is particularly effective for addressing the hip abductor weakness common in skateboarders, which can lead to knee injuries and poor lateral balance control. The bridge position also counters hip flexor tightness while the abduction component strengthens the muscles responsible for controlling knee tracking and lateral stability during skateboarding maneuvers. Focus on maintaining the bridge height while controlling both the outward and inward phases of the abduction movement.",
        "json_file": "banded_glute_bridge_abductors.json",
        "video_file": "banded_glute_bridge_abductors",
        "beginner": "15 reps (1 round)",
        "intermediate": "15–20 reps (2 rounds)",
        "advanced": "20–25 reps (2 rounds)"
      },
      {
        "section": "Warm-up",
        "move": "Banded abductors with kickouts",
        "description": "Standing band abduction followed by a small lateral kickout.",
        "detailed_description": "This dynamic activation exercise targets the hip abductors and ankle stabilizers through a two-phase movement that mimics the lateral control patterns essential for skateboarding balance and board manipulation. Begin standing with a resistance band around your ankles or lower legs, then lift one leg straight out to the side against the band resistance in a controlled abduction movement. From the peak abduction position, add a small explosive kickout or flick of the foot before returning to the starting position with control. The initial abduction phase activates the gluteus medius and tensor fasciae latae, while the kickout component engages the ankle stabilizers and enhances proprioceptive awareness. This combination directly translates to improved lateral balance control and the quick ankle adjustments needed for precise board manipulation during skateboarding. The exercise also helps develop the reactive strength and coordination needed for catching balance when landing tricks or navigating challenging terrain. Focus on maintaining stable posture in the standing leg while executing crisp, controlled movements in the working leg.",
        "json_file": "banded_abductors_with_kickouts.json",
        "video_file": "banded_abductors_with_kickouts",
        "beginner": "10 reps each side (1 round)",
        "intermediate": "12 reps each side (2 rounds)",
        "advanced": "15 reps each side (2 rounds)"
      },
      {
        "section": "Warm-up",
        "move": "1 foot heel bridges",
        "description": "Single-leg glute bridge with heel down and opposite leg lifted.",
        "detailed_description": "This advanced single-leg bridge variation challenges unilateral hip stability while improving calf and ankle mobility through the heel-only contact pattern essential for skateboarding performance. Begin lying supine with one heel planted on the floor and toes pulled up toward your shin, while the opposite leg is lifted and held straight in the air. Drive through the planted heel to lift your hips, creating a straight line from your knee to your shoulder while maintaining the lifted leg position. This exercise targets gluteus maximus strength and endurance on the working side while challenging core stability and hip flexor flexibility on the lifted side. The heel-only contact enhances ankle dorsiflexion mobility and activates the posterior chain muscles crucial for powerful skateboarding movements. This movement pattern directly translates to improved single-leg stability and strength needed for one-footed skateboarding maneuvers, manual variations, and the unilateral balance challenges common in street and transition skating. Focus on preventing hip rotation or dropping, maintaining level hips throughout the movement while emphasizing quality muscle activation over speed.",
        "json_file": "1_foot_heel_bridges.json",
        "video_file": "1_foot_heel_bridges",
        "beginner": "8–10 reps each side (1 round)",
        "intermediate": "10–12 reps each side (2 rounds)",
        "advanced": "12–15 reps each side (2 rounds)"
      }
    ]
  },
  {
    "name": "Strength",
    "icon": "dumbbell.fill",
    "color": "purple",
    "exercises": [
      {
        "section": "Main",
        "move": "Thrusters",
        "description": "Dumbbell front squat into an overhead press.",
        "detailed_description": "This compound full-body exercise combines lower body strength with upper body power and core stability, making it highly functional for skateboarding performance. Begin standing with dumbbells held at shoulder height in front rack position, feet hip-width apart with toes slightly turned out. Descend into a deep squat by pushing your hips back and down while keeping your chest up and core engaged. Drive explosively through your heels to stand up, using the momentum to press the dumbbells overhead in one fluid motion. Lower the weights back to shoulder height with control before beginning the next repetition. This exercise develops the explosive hip and leg power needed for ollies and jumping while building shoulder stability and core strength essential for balance and control during skateboarding. The combination movement also improves coordination and teaches efficient force transfer from the lower body through the core to the upper body, directly translating to more powerful and controlled skateboarding movements.",
        "json_file": "thrusters.json",
        "video_file": "thrusters",
        "beginner": "8 reps (light DBs)",
        "intermediate": "10 reps (moderate DBs)",
        "advanced": "12 reps (heavy DBs)"
      },
      {
        "section": "Main",
        "move": "Squat hold and pulses",
        "description": "Isometric squat hold followed by small controlled pulses.",
        "detailed_description": "This challenging isometric and dynamic exercise targets quadriceps endurance, glute activation, and mental toughness while building the sustained muscle strength needed for deep skateboarding stances. Begin in a squat position with feet hip-width apart, knees behind toes, and weight evenly distributed across both feet. Lower to approximately ninety degrees or your comfortable depth and hold this position while maintaining proper alignment with chest up and core engaged. After the prescribed hold time, perform small pulsing movements up and down within a 2-3 inch range at the bottom of the squat position. This exercise specifically develops the muscular endurance and strength in the exact positions used during skateboarding, particularly for transition skating, manual pads, and maintaining low stances during technical maneuvers. The isometric hold builds time under tension strength while the pulses add a dynamic component that challenges muscle fibers differently. Focus on maintaining proper form throughout and breathing steadily during the hold phase.",
        "json_file": "squat_hold_and_pulses.json",
        "video_file": "squat_hold_and_pulses",
        "beginner": "20 s hold + 10 pulses",
        "intermediate": "30 s hold + 15 pulses",
        "advanced": "45 s hold + 20 pulses"
      },
      {
        "section": "Main",
        "move": "Weighted Crab Walks",
        "description": "Reverse tabletop position; crawl forward/back while holding light weights.",
        "detailed_description": "This unique full-body exercise targets posterior chain strength, core stability, and coordination while adding resistance training to challenge the muscles in a novel movement pattern. Begin in a reverse tabletop position with hands planted behind you, knees bent, and hips lifted to create a straight line from knees to shoulders while holding light dumbbells. Maintain this elevated position and walk forward and backward by alternating hand and foot movements, keeping the hips elevated throughout. The added weight increases the challenge to your shoulders, triceps, and core while the walking motion develops coordination and proprioception. This exercise is particularly beneficial for skateboarders as it strengthens the posterior chain muscles often neglected by forward-facing activities while building the core and shoulder stability needed for inverted or unusual body positions sometimes encountered in skateboarding. The reverse movement pattern also helps balance out the forward-dominant postures common in daily life and skateboarding stances. Focus on maintaining hip elevation and smooth, controlled movements rather than speed.",
        "json_file": "weighted_crab_walks.json",
        "video_file": "weighted_crab_walks",
        "beginner": "10 steps forward + 10 back (light)",
        "intermediate": "12 steps forward + 12 back (moderate)",
        "advanced": "15 steps forward + 15 back (heavy)"
      },
      {
        "section": "Main",
        "move": "Weighted Lunges",
        "description": "Forward or walking lunges with dumbbells.",
        "detailed_description": "This fundamental single-leg strengthening exercise targets the quadriceps, glutes, and hamstrings while challenging balance and unilateral stability essential for skateboarding performance. Begin standing with dumbbells held at your sides or in front rack position, then step forward into a lunge by lowering your back knee toward the ground while keeping your front knee aligned over your ankle. The front thigh should reach parallel to the ground if mobility allows, creating ninety-degree angles at both knees. Drive through the front heel to return to standing, then repeat on the opposite side or continue walking forward. This exercise directly translates to improved single-leg strength and stability needed for skateboarding maneuvers like pushing, landing tricks on one foot, and maintaining balance during uneven weight distribution. The added resistance challenges the muscles more than bodyweight alone while the unilateral nature addresses strength imbalances common from skateboarding's asymmetrical demands. Focus on maintaining upright torso posture and controlled descent to maximize the strength and stability benefits.",
        "json_file": "weighted_lunges.json",
        "video_file": "weighted_lunges",
        "beginner": "8 reps/side (light DBs)",
        "intermediate": "10 reps/side (moderate DBs)",
        "advanced": "12 reps/side (heavier DBs)"
      },
      {
        "section": "Main",
        "move": "Weighted step ups",
        "description": "Step onto a box/bench with dumbbells, drive through front heel.",
        "detailed_description": "This unilateral leg strengthening exercise targets the quadriceps, glutes, and calves while improving single-leg power and coordination directly applicable to skateboarding movements. Begin standing facing a sturdy box or bench with dumbbells held at your sides, then place one foot completely on the box surface. Drive through the heel of the elevated foot to step up onto the box, bringing the trailing leg up to meet the first. Step down with control, leading with the same leg that stepped up first, then repeat for the prescribed repetitions before switching sides. This exercise specifically develops the single-leg strength and power needed for pushing off during skateboarding, navigating obstacles, and the explosive leg drive required for ollies and other jumping movements. The added weight increases the strength challenge while the step-up motion mimics many functional movement patterns used in skateboarding. Choose a box height that allows you to maintain proper knee alignment - your knee should not cave inward during the movement. Focus on driving through the heel of the working leg rather than pushing off with the trailing toe.",
        "json_file": "weighted_step_ups.json",
        "video_file": "weighted_step_ups",
        "beginner": "8 reps/side (box below knee)",
        "intermediate": "10 reps/side (box at knee)",
        "advanced": "12 reps/side (box at/above knee)"
      },
      {
        "section": "Main",
        "move": "Weighted side 2 side abductors",
        "description": "Standing hip abductions moving side-to-side with load.",
        "detailed_description": "This dynamic hip abduction exercise targets the gluteus medius, gluteus minimus, and tensor fasciae latae while adding resistance and movement challenges that directly translate to improved skateboarding lateral control and stability. Begin standing with feet hip-width apart while holding dumbbells at your sides or a single weight in front of your chest. Step laterally to one side while simultaneously lifting the opposite leg out to the side against gravity and the added resistance, then step the lifted leg down and continue the lateral movement in that direction. The combination of stepping and abduction creates a functional movement pattern that strengthens the hip stabilizers while challenging balance and coordination. This exercise is particularly beneficial for skateboarders as it develops the lateral strength and control needed for carving, transitioning between obstacles, and maintaining balance during side-to-side weight shifts on the board. The added resistance increases the strength challenge while the continuous lateral movement builds endurance in the hip abductors. Focus on maintaining level hips and controlled movements throughout the exercise.",
        "json_file": "weighted_side_to_side_abductors.json",
        "video_file": "weighted_side_to_side_abductors",
        "beginner": "10 reps/side (light load)",
        "intermediate": "12 reps/side (moderate load)",
        "advanced": "15 reps/side (heavier load)"
      },
      {
        "section": "Main",
        "move": "1 foot balance weight press",
        "description": "Single-leg stance, alternating overhead presses.",
        "detailed_description": "This challenging combination exercise targets single-leg stability, core strength, and shoulder mobility while integrating multiple movement demands that directly translate to improved skateboarding balance and control. Begin standing on one leg while holding dumbbells in both hands at shoulder height, engaging your core and focusing on a fixed point for balance. Perform alternating overhead presses while maintaining the single-leg stance, pressing one dumbbell overhead while keeping the other at shoulder height. The single-leg position challenges your balance system and forces deep stabilizer muscle activation throughout your kinetic chain, while the overhead pressing motion develops functional upper body strength and core stability. This exercise specifically improves the ability to maintain balance while performing complex movements, essential for skateboarding tricks that require precise balance control during dynamic upper body movements. The unilateral stance also builds the ankle, knee, and hip stability crucial for single-leg skateboarding maneuvers and landing control. Focus on maintaining steady posture and avoid compensating with excessive upper body movement or allowing the standing knee to collapse inward.",
        "json_file": "1_foot_balance_weight_press.json",
        "video_file": "1_foot_balance_weight_press",
        "beginner": "8 reps/side (2×5–10 lb)",
        "intermediate": "10 reps/side (2×10–15 lb)",
        "advanced": "12 reps/side (2×15–20 lb)"
      },
      {
        "section": "Main",
        "move": "Kettle Bell swings",
        "description": "Hip-hinge drive to swing a kettlebell to chest height.",
        "detailed_description": "This explosive posterior chain exercise targets the glutes, hamstrings, and core while developing the hip extension power and timing essential for skateboarding performance. Begin standing with feet slightly wider than hip-width apart and a kettlebell positioned between your legs. Hinge at the hips by pushing your glutes back while maintaining a neutral spine, then explosively drive your hips forward to swing the kettlebell up to chest height. The power should come entirely from the hip thrust, not from lifting with your arms - your arms simply guide the kettlebell's path. Allow the kettlebell to swing back down between your legs as you hinge at the hips again, maintaining control throughout the descent. This exercise directly develops the explosive hip extension power needed for ollies, jumping, and generating speed through pumping motions in transition skateboarding. The hip hinge pattern also reinforces proper movement mechanics that protect the lower back during dynamic activities. Focus on timing the hip drive to create a smooth, powerful swing and maintain core engagement throughout to protect your spine.",
        "json_file": "kettle_bell_swings.json",
        "video_file": "kettle_bell_swings",
        "beginner": "12 reps (light KB)",
        "intermediate": "15–20 reps (moderate KB)",
        "advanced": "20–25 reps (heavier KB)"
      }
    ]
  },
  {
    "name": "Core & Stability",
    "icon": "figure.core.training",
    "color": "teal",
    "exercises": [
      {
        "section": "Main",
        "move": "Side plank dips",
        "description": "From side plank, lower hips toward floor and lift back to neutral.",
        "detailed_description": "This dynamic core strengthening exercise targets the quadratus lumborum, obliques, and deep stabilizer muscles while building lateral spine stability essential for skateboarding balance and control. Begin in a side plank position with your elbow directly under your shoulder and your body forming a straight line from head to feet. Lower your hips toward the floor in a controlled motion, maintaining the straight line alignment, then lift back up to the neutral side plank position. The movement challenges your lateral core muscles to control both the eccentric lowering and concentric lifting phases. This exercise directly translates to improved lateral balance control needed for skateboarding maneuvers that involve leaning or shifting weight to one side, such as carving, rail slides, and maintaining balance during uneven terrain navigation. The lateral strength also helps prevent lower back injuries common in activities requiring repeated spine rotation and lateral flexion. Focus on maintaining proper shoulder alignment and avoid allowing your hips to rotate or twist during the movement - the motion should occur purely in the frontal plane.",
        "json_file": "side_plank_dips.json",
        "video_file": "side_plank_dips",
        "beginner": "10 reps each side",
        "intermediate": "12–15 reps each side",
        "advanced": "15–20 reps each side"
      },
      {
        "section": "Main",
        "move": "Banded mountain climbers",
        "description": "High-plank knee drives with band around feet or ankles.",
        "detailed_description": "This high-intensity core and cardiovascular exercise combines plank stability with dynamic hip flexion while adding resistance training to challenge the entire kinetic chain. Begin in a high plank position with hands directly under shoulders and a resistance band around your feet or ankles. Maintain the plank position while alternately driving your knees toward your chest, fighting against the band resistance throughout the movement. The band adds significant challenge to both the knee drive phase and the return to extended position, while the plank hold demands constant core activation and shoulder stability. This exercise directly improves the core endurance and hip flexor strength needed for skateboarding tricks involving knee drive and board manipulation, such as ollies, kickflips, and manual variations. The dynamic nature also builds cardiovascular fitness and neuromuscular coordination essential for sustained skateboarding performance. Focus on maintaining a strong plank position throughout - avoid allowing your hips to pike up or sag down as fatigue sets in. Control both the forward and backward phases of each knee drive for maximum benefit.",
        "json_file": "banded_mountain_climbers.json",
        "video_file": "banded_mountain_climbers",
        "beginner": "20 total (light band)",
        "intermediate": "30 total (medium band)",
        "advanced": "40 total (heavy band)"
      },
      {
        "section": "Main",
        "move": "Banded Side clams",
        "description": "Side-lying, knees bent; open top knee without rolling hips.",
        "detailed_description": "This targeted hip strengthening exercise isolates the gluteus medius and deep hip rotators while adding resistance training to develop the lateral hip stability essential for skateboarding control and injury prevention. Begin lying on your side with knees bent at approximately ninety degrees and a resistance band positioned around your thighs just above the knees. Keep your feet together and maintain neutral spine alignment while lifting the top knee away from the bottom knee against the band resistance. The key is to initiate the movement from the hip without allowing the pelvis to roll backward or the torso to twist. This exercise specifically targets the often-neglected hip abductors that are crucial for maintaining proper knee alignment and lateral stability during skateboarding. Weak hip abductors can lead to knee pain, poor balance control, and increased injury risk during dynamic skateboarding movements. The side-lying position eliminates compensation patterns and allows for focused strengthening of these important stabilizer muscles. Focus on controlled movement quality over speed, and maintain the pelvis in a neutral position throughout the exercise to maximize the targeted muscle activation.",
        "json_file": "banded_side_clams.json",
        "video_file": "banded_side_clams",
        "beginner": "12 reps each side",
        "intermediate": "15 reps each side",
        "advanced": "20 reps each side"
      },
      {
        "section": "Main",
        "move": "Adductors with med ball",
        "description": "Supine or seated, squeeze a medicine ball between knees.",
        "detailed_description": "This isometric strengthening exercise targets the hip adductor muscles while building inner thigh strength and stability crucial for skateboard control and proper lower body alignment. Begin in a seated or supine position with a medicine ball positioned between your knees, maintaining good posture with your spine in neutral alignment. Squeeze the ball firmly with your inner thighs, holding the contraction for the prescribed time or performing rhythmic squeezes. The adductor muscles work to bring the legs together and provide stability during single-leg activities and dynamic movements. For skateboarders, strong adductors help maintain proper knee alignment during tricks and landings, contribute to overall leg strength balance, and provide stability during narrow stance positions common in skateboarding. Weak adductors relative to the outer hip muscles can lead to knee pain and poor movement patterns. This exercise complements the hip abduction work by ensuring balanced strength development around the hip joint. Focus on maintaining consistent pressure against the ball and avoid holding your breath during sustained contractions.",
        "json_file": "adductors__with_med_ball.json",
        "video_file": "adductors_with_med_ball",
        "beginner": "15 squeezes (light ball)",
        "intermediate": "20 squeezes (moderate ball)",
        "advanced": "25–30 squeezes (heavier ball)"
      },
      {
        "section": "Cool-down",
        "move": "Sitting bench pigeon and knee hugs",
        "description": "Seated figure-four stretch on a bench, then finish with knee hug stretch.",
        "detailed_description": "This comprehensive cool-down stretch combines hip external rotator stretching with hip flexor mobility in a comfortable seated position ideal for post-workout recovery. Begin seated on a bench or chair with good posture, then place one ankle across the opposite thigh in a figure-four position. Gently lean forward from your hips to increase the stretch through the outer hip and glutes of the crossed leg, maintaining a neutral spine throughout. After holding the pigeon stretch, transition to pulling the same knee toward your chest for a knee hug stretch that targets the glutes and lower back. This combination addresses the key areas of tightness that develop from skateboarding's asymmetrical stance patterns and crouched positions. The seated position makes these stretches accessible and comfortable while providing stable support for deeper relaxation and muscle lengthening. This stretch sequence is particularly effective for releasing tension in the hips and lower back after intense skateboarding sessions or strength training. Focus on breathing deeply and allowing gravity to assist the stretch rather than forcing the range of motion.",
        "json_file": "sitting_bench_pigeons_and_knee_hugs.json",
        "video_file": "sitting_bench_pigeons_and_knee_hugs",
        "beginner": "Hold 20 s/side",
        "intermediate": "Hold 30 s/side",
        "advanced": "Hold 45 s/side"
      }
    ]
  },
  {
    "name": "Pre-Skate Warm-Up",
    "icon": "figure.skateboarding",
    "color": "green",
    "exercises": [
      {
        "section": "Warm-up",
        "move": "Ankle circles",
        "description": "Stand tall, lift one foot off the ground, rotate the ankle in big circles clockwise then counterclockwise to prepare for board control",
        "detailed_description": "This fundamental mobility exercise targets ankle joint range of motion and activates the intrinsic foot muscles crucial for skateboard control and push-off efficiency. Begin in a standing position with good posture, then lift one foot slightly off the ground while maintaining balance on the opposite leg. Create large, controlled circular motions with your ankle, moving through the full range of motion in both clockwise and counterclockwise directions. Focus on maximizing the range of motion in all directions - dorsiflexion pulling the toes up, plantarflexion pointing down, inversion turning the sole inward, and eversion turning outward. This exercise is essential for pre-skating preparation as it warms up the ankle joint, improves proprioception, and prepares the small stabilizer muscles for the demands of board control and balance adjustments. Limited ankle mobility can significantly impact skateboarding performance, affecting stance depth, push-off power, and landing mechanics. Take your time with each circle and focus on smooth, controlled movement rather than speed to maximize the mobility and activation benefits.",
        "json_file": "ankle_circles.json",
        "video_file": "ankle_circles",
        "beginner": "8 each direction/foot",
        "intermediate": "10 each direction/foot", 
        "advanced": "12 each direction/foot"
      },
      {
        "section": "Warm-up",
        "move": "Ankle rocks",
        "description": "Rock forward and backward on your toes and heels to activate ankle mobility for skateboarding stance",
        "detailed_description": "This dynamic ankle mobility exercise targets dorsiflexion and plantarflexion range of motion while activating the calf and shin muscles essential for skateboarding stance control and landing mechanics. Begin standing with feet hip-width apart and slowly rock forward onto your toes, lifting your heels as high as possible while maintaining balance. Hold briefly at the top position, then rock backward onto your heels, lifting your toes as high as possible toward your shins. This alternating movement pattern mobilizes the ankle joint through its primary motion planes while activating both the posterior muscles (calves) and anterior muscles (shins) that control ankle movement. For skateboarders, this exercise is crucial for preparing the ankles for the demands of board control, where subtle ankle adjustments are constantly needed for balance and trick execution. The rocking motion also improves proprioceptive awareness and prepares the neuromuscular system for the rapid balance corrections required during skating. Focus on controlled movement through the full range of motion and maintain steady balance throughout the exercise.",
        "json_file": "ankle_rocks.json",
        "video_file": "ankle_rocks",
        "beginner": "10 rocks forward/back",
        "intermediate": "12 rocks forward/back",
        "advanced": "15 rocks forward/back"
      },
      {
        "section": "Warm-up", 
        "move": "Standing weight shifts",
        "description": "Shift weight from one foot to the other in skateboarding stance to prepare for balance and transitions",
        "detailed_description": "This skateboard-specific warm-up exercise mimics the weight transfer patterns fundamental to board control while activating the proprioceptive system and balance muscles. Begin in a skateboarding stance with feet positioned as you would on a board, then slowly shift your weight from one foot to the other while maintaining balance and control. Focus on feeling the weight distribution change and the subtle muscle activations required to maintain stability during the transfer. This exercise directly prepares your neuromuscular system for the constant weight shifts required in skateboarding, including pumping for speed, carving turns, and preparing for tricks. The movement also activates the ankle stabilizers, hip abductors, and core muscles that work together to maintain balance during dynamic skateboarding movements. Regular practice of weight shifts improves body awareness and balance reactions that are essential for progressing in skateboarding and preventing falls. Keep the movements slow and controlled to maximize the proprioceptive benefits and focus on smooth, fluid weight transfers rather than abrupt shifts.",
        "json_file": "standing_weight_shifts.json",
        "video_file": "standing_weight_shifts",
        "beginner": "10 shifts each way",
        "intermediate": "12 shifts each way",
        "advanced": "15 shifts each way"
      },
      {
        "section": "Warm-up",
        "move": "Knee hug turns", 
        "description": "Standing knee hug with rotation through the hip to open up hip mobility for skateboarding movements",
        "detailed_description": "This dynamic warm-up combines hip flexor mobility with rotational movement patterns that prepare the body for skateboarding's multi-directional demands and complex trick mechanics. Begin standing tall, then lift one knee toward your chest while grasping behind the thigh with both hands. From this knee hug position, initiate a controlled rotation through your torso and hip, stepping the lifted leg across your body in a turning motion before placing it down and transitioning to the opposite side. The movement activates hip flexors, improves rotational mobility through the thoracic spine, and challenges balance and coordination systems simultaneously. This exercise specifically prepares skateboarders for the rotational components found in turns, transition skating, and trick execution where the body must coordinate upper and lower body rotation while maintaining balance. The combination of hip flexion and rotation also helps address mobility restrictions that can limit skateboarding performance and increase injury risk. Focus on smooth, controlled movements and maintain balance throughout the rotation rather than rushing through the exercise.",
        "json_file": "knee_hug_turns.json",
        "video_file": "knee_hug_turns",
        "beginner": "6 reps each side",
        "intermediate": "8 reps each side",
        "advanced": "10 reps each side"
      },
      {
        "section": "Main",
        "move": "Single leg board stance",
        "description": "Practice single-leg balance on a balance board to mimic skateboard control and stability",
        "detailed_description": "This advanced balance training exercise specifically targets single-leg stability and proprioceptive awareness using an unstable surface that closely mimics skateboard control demands. Begin standing on a balance board or wobble board with both feet, then carefully lift one leg while maintaining balance on the unstable surface. The balance board creates constant perturbations that challenge your ankle, knee, and hip stabilizers while forcing rapid neuromuscular adjustments similar to those required during skateboarding. This exercise directly transfers to improved board control, especially for manuals, single-leg tricks, and maintaining balance during challenging skateboarding scenarios. The unstable surface trains your balance system to make quick, precise adjustments that are essential for skateboarding progression and injury prevention. Single-leg training on an unstable surface is particularly beneficial as it addresses the unilateral demands of skateboarding while challenging the balance system in a skateboard-specific way. Focus on maintaining steady posture and making small, controlled adjustments rather than large corrections, as this develops the subtle balance control needed for advanced skateboarding.",
        "json_file": "single_leg_board_stance.json", 
        "video_file": "single_leg_board_stance",
        "beginner": "20 seconds each leg",
        "intermediate": "30 seconds each leg",
        "advanced": "45 seconds each leg"
      },
      {
        "section": "Main",
        "move": "Ice skaters",
        "description": "Lateral jumping movement that mimics the pumping motion used in skateparks and transitions",
        "detailed_description": "This dynamic plyometric exercise targets lateral power, single-leg stability, and the pumping mechanics essential for generating speed and momentum in transition skateboarding. Begin standing on one leg, then explosively jump laterally to land on the opposite leg while swinging your arms for momentum and balance. The movement mimics the side-to-side pumping motion used to generate speed in bowls, ramps, and transitions. Land softly on the outside leg with knee slightly bent, then immediately prepare for the next jump in the opposite direction. This exercise develops the lateral power and single-leg landing control crucial for transition skating while building the cardiovascular fitness needed for sustained skateboarding sessions. The rapid lateral movements also improve agility and reaction time that transfer to better board control during dynamic skateboarding scenarios. Ice skaters specifically train the neuromuscular patterns needed for pumping, carving, and maintaining momentum in skateparks. Focus on explosive takeoffs, soft landings, and maintaining balance throughout each lateral bound for maximum benefit.",
        "json_file": "ice_skaters.json",
        "video_file": "ice_skaters", 
        "beginner": "10 jumps each side",
        "intermediate": "12 jumps each side", 
        "advanced": "15 jumps each side"
      },
      {
        "section": "Main",
        "move": "Single leg bounds",
        "description": "Explosive single-leg hops to build power and stability for skateboarding landings and ollies",
        "detailed_description": "This plyometric exercise develops single-leg power, landing mechanics, and the explosive strength needed for skateboarding tricks like ollies, jumps, and technical maneuvers. Begin standing on one leg with good posture and core engagement, then explosively hop forward, focusing on maximum distance while maintaining balance and control. Land softly on the same leg with knee bent to absorb impact, then immediately prepare for the next bound. This exercise specifically trains the unilateral power and landing control essential for skateboarding, where many movements require explosive single-leg actions and stable landings. The bounding motion develops the fast-twitch muscle fibers and neuromuscular coordination needed for powerful skateboarding movements while improving proprioception and balance reactions. Single-leg bounds also strengthen the entire kinetic chain from ankle to hip, addressing the stability and strength imbalances common from skateboarding's asymmetrical demands. Focus on quality over quantity - each bound should be explosive and controlled with proper landing mechanics to maximize the training benefits and reduce injury risk.",
        "json_file": "single_leg_bounds.json",
        "video_file": "single_leg_bounds",
        "beginner": "6 bounds each leg",
        "intermediate": "8 bounds each leg", 
        "advanced": "10 bounds each leg"
      },
      {
        "section": "Main",
        "move": "Lateral banded walk",
        "description": "Side-to-side movement with resistance band to strengthen hip abductors crucial for skateboard control",
        "detailed_description": "This targeted hip strengthening exercise develops the gluteus medius and hip abductors that are essential for lateral stability and skateboard control during carving, transitions, and balance challenges. Begin with a resistance band positioned just above your knees, then sink into a partial squat position with feet hip-width apart and core engaged. Maintain constant tension in the band as you step laterally, leading with the outside leg while keeping both knees tracking over your toes. The trailing leg should resist the inward pull of the band, creating co-contraction of the hip stabilizers that improves overall hip stability and control. This movement pattern directly translates to improved lateral balance and control when carving, transitioning between obstacles, or maintaining stability during side-to-side weight shifts on the skateboard. Strong hip abductors also help prevent knee injuries by maintaining proper lower extremity alignment during dynamic movements. Keep your torso upright and avoid allowing the knees to cave inward, as proper knee tracking is essential for both performance and injury prevention in skateboarding.",
        "json_file": "lateral_banded_walk.json",
        "video_file": "lateral_banded_walk",
        "beginner": "10 steps each way",
        "intermediate": "12 steps each way",
        "advanced": "15 steps each way"
      },
      {
        "section": "Main",
        "move": "Calf raises",
        "description": "Rise up on your toes to strengthen calves and improve push-off power for skateboarding",
        "detailed_description": "This fundamental lower leg strengthening exercise targets the gastrocnemius and soleus muscles while improving push-off power and ankle stability essential for skateboarding propulsion and balance control. Begin standing with feet hip-width apart and slowly rise up onto your toes, lifting your heels as high as possible while maintaining balance and proper alignment. Hold briefly at the top position to maximize muscle activation, then lower with control back to the starting position. This exercise directly develops the calf strength needed for powerful push-offs when propelling yourself forward on a skateboard, as well as the ankle stability required for precise board control and balance adjustments. Strong calves also contribute to better landing mechanics and shock absorption during jumps and trick landings. The controlled movement pattern builds both strength and endurance in the posterior lower leg muscles while improving proprioceptive awareness through the feet and ankles. Focus on full range of motion and avoid bouncing at the bottom position - smooth, controlled movement will maximize the strengthening benefits and improve the neuromuscular control needed for skateboarding performance.",
        "json_file": "calf_raises.json",
        "video_file": "calf_raises", 
        "beginner": "12 reps",
        "intermediate": "15 reps",
        "advanced": "20 reps"
      },
      {
        "section": "Main", 
        "move": "Balance board tilts",
        "description": "Rock side-to-side on balance board to develop proprioception and board control skills",
        "detailed_description": "This skateboard-specific balance training exercise develops lateral stability, proprioceptive awareness, and the subtle weight shift control essential for advanced skateboarding performance. Begin standing on a balance board with feet positioned similarly to your skateboard stance, then initiate controlled side-to-side tilting movements by shifting your weight from rail to rail. The unstable surface forces constant micro-adjustments from your ankle, knee, and hip stabilizers while training the balance reactions needed for skateboard control. This exercise directly transfers to improved board control, especially for carving, pumping transitions, and maintaining balance during challenging skating scenarios. The tilting motion specifically trains the lateral weight shift patterns used in skateboarding while building confidence and control on unstable surfaces. Balance board training also enhances proprioceptive feedback and reaction time, leading to quicker balance recovery and reduced fall risk during skating. Focus on smooth, controlled tilts rather than aggressive movements, gradually increasing the range of motion as your balance and control improve. This develops the subtle balance skills needed for advanced skateboarding progression.",
        "json_file": "balance_board_tilts.json",
        "video_file": "balance_board_tilts",
        "beginner": "10 tilts each direction",
        "intermediate": "12 tilts each direction", 
        "advanced": "15 tilts each direction"
      }
    ]
  },
  {
    "name": "Post-Skate Cool-Down",
    "icon": "figure.cooldown",
    "color": "cyan",
    "exercises": [
      {
        "section": "Cool-down",
        "move": "Calf wall stretch",
        "description": "Stand facing a wall, place ball of one foot on it with heel on ground, lean forward to stretch tight calves after skating",
        "detailed_description": "This post-skate recovery stretch specifically targets the gastrocnemius and soleus muscles that work intensively during skateboarding push-offs and balance control. Stand facing a wall at arm's length, then place the ball of one foot against the wall with your heel firmly planted on the ground. Keep the stretching leg straight and slowly lean your hips forward toward the wall, maintaining heel contact throughout the movement to create a deep stretch through the calf and Achilles tendon. This stretch is particularly important after skateboarding sessions as the calves often become tight from repetitive push-off motions and the constant micro-adjustments needed for balance control. Tight calves can limit ankle mobility, affecting your skateboarding stance and increasing injury risk, making this stretch essential for recovery and maintaining optimal performance. The wall provides stable support and allows for consistent pressure application throughout the stretch. Hold the stretch steadily and focus on deep breathing to promote relaxation and tissue lengthening, avoiding any bouncing or aggressive stretching that could cause injury to the tight muscles.",
        "json_file": "calf_wall_stretch.json",
        "video_file": "calf_wall_stretch",
        "beginner": "Hold 20 s/side",
        "intermediate": "Hold 30 s/side",
        "advanced": "Hold 45 s/side"
      },
      {
        "section": "Cool-down",
        "move": "Calf and ankle stretch",
        "description": "Comprehensive calf and ankle stretch to release tension from skateboarding stance and push-offs",
        "detailed_description": "This comprehensive post-skate stretch targets both the calf muscles and ankle joint mobility, addressing the specific tightness patterns that develop from skateboarding's demands on the lower leg complex. The stretch can be performed in various positions - seated with legs extended, standing with one foot elevated, or in a runner's lunge position - focusing on both gastrocnemius and soleus muscles while improving ankle dorsiflexion range of motion. This stretch is essential for skateboarding recovery as both the calves and ankle joints work continuously during skating for push-offs, balance adjustments, and landing control. The comprehensive approach addresses all aspects of the lower leg tightness that can develop from prolonged skateboarding sessions, helping maintain optimal ankle mobility and preventing the development of compensatory movement patterns. Regular performance of this stretch helps prevent calf cramps, reduces Achilles tendon tension, and maintains the ankle range of motion needed for optimal skateboarding stance and performance. Focus on gentle, sustained stretching with deep breathing to maximize the relaxation and recovery benefits.",
        "json_file": "calf_and_ankle_stretch.json",
        "video_file": "calf_and_ankle_stretch", 
        "beginner": "Hold 20 s/side",
        "intermediate": "Hold 30 s/side",
        "advanced": "Hold 45 s/side"
      },
      {
        "section": "Cool-down",
        "move": "Hip flexor stretch",
        "description": "Lunge position stretch to open tight hip flexors from crouched skateboarding positions",
        "detailed_description": "This essential post-skate stretch targets the hip flexor muscles that often become tight and shortened from skateboarding's characteristic crouched stance and repetitive hip flexion movements. Begin in a lunge position with one foot forward and the other leg extended behind you, then lower your hips toward the ground while keeping your torso upright and core engaged. You should feel a strong stretch through the front of the hip and thigh of the back leg. This stretch is crucial for skateboarders as prolonged hip flexor tightness can lead to lower back pain, altered movement patterns, and reduced skateboarding performance. The crouched skateboarding position places the hip flexors in a shortened position for extended periods, making this stretch essential for maintaining optimal hip mobility and preventing compensatory movement patterns. Hip flexor tightness can also affect your ability to achieve proper skateboarding stances and limit the range of motion needed for advanced tricks. Focus on maintaining an upright torso position and avoid arching your lower back excessively, as proper alignment maximizes the stretch effectiveness and prevents lower back strain.",
        "json_file": "hip_flexor_stretch.json",
        "video_file": "hip_flexor_stretch",
        "beginner": "Hold 20 s/side",
        "intermediate": "Hold 30 s/side", 
        "advanced": "Hold 45 s/side"
      },
      {
        "section": "Cool-down",
        "move": "Standing crossed-leg hamstring",
        "description": "Cross one foot in front, hinge forward to stretch hamstrings that work hard during skating",
        "detailed_description": "This functional post-skate hamstring stretch combines targeted posterior chain lengthening with hip hinge mechanics, making it ideal for addressing the hamstring tightness that develops from skateboarding's dynamic demands. Begin standing with feet hip-width apart, then cross one foot in front of the other while keeping both feet planted firmly on the ground. Initiate a hip hinge movement by pushing your hips backward and lowering your torso toward the front leg while maintaining a neutral spine and avoiding rounding your back. The crossed-leg position isolates the hamstring stretch to the front leg while the hip hinge pattern reinforces proper movement mechanics essential for skateboarding and daily activities. This stretch is particularly important for skateboarders as the hamstrings work hard during the crouched skating position, landing mechanics, and explosive movements required for tricks. The standing position also incorporates balance and proprioceptive challenges that translate to improved board control and stability. Focus on the hip hinge movement pattern rather than just reaching forward, as this maximizes the hamstring stretch while reinforcing healthy movement patterns that benefit overall skateboarding performance.",
        "json_file": "standing_crossed_leg_hamstring.json",
        "video_file": "standing_crossed_leg_hamstring",
        "beginner": "Hold 20 s/side", 
        "intermediate": "Hold 30 s/side",
        "advanced": "Hold 45 s/side"
      },
      {
        "section": "Cool-down",
        "move": "Flamingo stretch", 
        "description": "Standing quad stretch to release tension in the front of thighs from skateboarding stance",
        "detailed_description": "This classic standing quadriceps stretch targets the front thigh muscles that often become tight from the bent-knee positions and explosive movements common in skateboarding. Stand on one leg and bend the other knee, grasping the ankle or foot behind you and gently pulling the heel toward your glutes while maintaining balance and proper alignment. Keep your knees close together and avoid arching your lower back excessively during the stretch. This stretch is essential for post-skate recovery as the quadriceps muscles work intensively during the crouched skateboarding stance, landing mechanics, and the explosive knee extension needed for ollies and jumps. Tight quadriceps can contribute to knee pain, altered movement patterns, and reduced hip mobility, making this stretch crucial for maintaining optimal lower body function and skateboarding performance. The standing balance component also challenges proprioception and single-leg stability, which provides additional benefits for skateboard control and balance. Focus on gentle, sustained stretching while maintaining steady balance on the supporting leg, using a wall or other support if needed to maintain proper form and maximize the stretch benefits.",
        "json_file": "flamingo_stretch.json",
        "video_file": "flamingo_stretch",
        "beginner": "Hold 20 s/side",
        "intermediate": "Hold 30 s/side",
        "advanced": "Hold 45 s/side"
      },
      {
        "section": "Cool-down",
        "move": "Figure-four stretch",
        "description": "Seated or lying figure-four position to stretch glutes and IT band after skateboarding",
        "detailed_description": "This comprehensive hip stretch targets the glutes, piriformis, and IT band complex that can become tight and imbalanced from skateboarding's asymmetrical stance patterns and repetitive movements. Begin in a seated or lying position, then cross one ankle over the opposite thigh just above the knee, creating a figure-four shape with your legs. Gently pull the uncrossed leg toward your chest or lean forward if seated to deepen the stretch through the outer hip and glutes of the crossed leg. This stretch is particularly important for skateboarders who develop tightness and strength imbalances from consistently riding in the same stance, as it addresses the deep hip rotators and external stabilizers that work hard during board control and balance maintenance. The figure-four position provides an effective stretch for the often-neglected posterior and lateral hip muscles while promoting relaxation and recovery after intense skateboarding sessions. Regular performance of this stretch helps prevent hip dysfunction, reduces lower back tension, and maintains the hip mobility needed for optimal skateboarding stance and trick execution. Focus on breathing deeply and allowing gravity to assist the stretch rather than forcing the range of motion.",
        "json_file": "figure_four_stretch.json", 
        "video_file": "figure_four_stretch",
        "beginner": "Hold 20 s/side",
        "intermediate": "Hold 30 s/side",
        "advanced": "Hold 45 s/side"
      },
      {
        "section": "Cool-down",
        "move": "Ankle circles",
        "description": "Gentle ankle rotations to restore mobility and circulation after intensive skateboarding",
        "detailed_description": "This gentle recovery exercise promotes ankle mobility and circulation while helping to restore normal joint function after intensive skateboarding sessions. Sit or stand comfortably and lift one foot slightly off the ground, then create slow, controlled circular motions with your ankle, moving through the full range of motion in both directions. Focus on smooth, relaxed movement rather than forced stretching, allowing the ankle joint to decompress and the surrounding muscles to relax. This cool-down exercise is essential after skateboarding as it helps restore normal ankle joint mobility that may become restricted from the sustained positions and repetitive movements required for board control. The circular motion promotes blood flow and lymphatic drainage, helping to reduce any swelling or stiffness that may have developed during skating. Gentle ankle circles also help transition the nervous system from the high-alert state needed for skateboarding balance to a more relaxed recovery mode. Take your time with each circle and focus on the sensation of movement and relaxation, as this exercise serves both physical and mental recovery purposes after demanding skateboarding sessions.",
        "json_file": "ankle_circles.json",
        "video_file": "ankle_circles",
        "beginner": "6 circles each direction/foot",
        "intermediate": "8 circles each direction/foot",
        "advanced": "10 circles each direction/foot" 
      }
    ]
  }
] 
